In [237]:
import pandas as pd
import numpy as np

In [238]:
# 任务1：将列表转换为Numpy数组
import numpy as np
data0 = [2,4,9,10]
arr0= np.array(data0)

In [239]:
# 任务2：新建pandas中的series数据类型，打印出查看其大小、索引值、值

In [240]:
# pandas中的Series数据类型
s= pd.Series(data=[100,'a',{'dic1':5}],
             index=pd.Index(['id1',20,'third'], name='my_idx'),
             dtype= 'object',
             name='my_name' )

In [241]:
s2=pd.Series(["1","2","3","4"])

In [242]:
s2.index.values

array([0, 1, 2, 3], dtype=int64)

In [243]:
s2.values

array(['1', '2', '3', '4'], dtype=object)

In [244]:
type(s2.values[0])

str

In [245]:
s2.size

4

In [246]:
s2.shape

(4,)

In [247]:
s2.shape[0]

4

In [248]:
# 任务3：创建dataframe类型的数据并获取其索引、值及表格大小
d = {
    "one":pd.Series([1.0,2.0,3.0],index=["a","b","c"]),
    "two":pd.Series([1.0,2.0,3.0,4.0,5.0],index=["a","b","c","d","e"]),
}
df=pd.DataFrame(d)

In [249]:
# 练习
d1 = {
    "书名":pd.Series(['新世纪福音战士','黑色五叶草','进击的巨人','死神']),
    "作者":pd.Series(['庵野秀明','田畠裕基','谏山创','久保带人']),
    "价格":pd.Series([88,98,250,188]),
}
df2=pd.DataFrame(d1)

In [250]:
df2.index.values

array([0, 1, 2, 3], dtype=int64)

In [251]:
df2.size

12

In [252]:
df2['作者']

0    庵野秀明
1    田畠裕基
2     谏山创
3    久保带人
Name: 作者, dtype: object

In [253]:
df2[['作者','价格']]

     作者   价格
0  庵野秀明   88
1  田畠裕基   98
2   谏山创  250
3  久保带人  188

In [254]:
贵州茅台原始数据 = pd.read_csv(R'data\600519.csv')

In [255]:
# 按列查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [256]:
贵州茅台原始数据[['TURNOVER','volume']]

         TURNOVER  volume
0      1410347008  406318
1       463463008  129647
2       194689000   53252
3       177558000   48013
4        86231000   23231
...           ...     ...
4089   2694714080   49076
4090  10663392512  204397
4091   5239853056   96885
4092   5581027328   98107
4093   5227695104   89157

[4094 rows x 2 columns]

In [257]:
# 按照行索引
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [258]:
贵州茅台原始数据.set_index('day')

            STOCK_CODE    open   close  maximum  minimum  volume     TURNOVER
day
2001-08-27     6005191   34.51   35.55    37.78    32.85  406318   1410347008
2001-08-28     6005191   34.99   36.86    37.00    34.61  129647    463463008
2001-08-29     6005191   36.98   36.38    37.00    36.10   53252    194689000
2001-08-30     6005191   36.28   37.10    37.51    36.00   48013    177558000
2001-08-31     6005191   37.15   37.01    37.62    36.80   23231     86231000
...                ...     ...     ...      ...      ...     ...          ...
2018-10-29     6005191  549.09  549.09   549.09   549.09   49076   2694714080
2018-10-30     6005191  510.00  524.00   543.00   509.02  204397  10663392512
2018-10-31     6005191  527.00  548.90   555.00   522.00   96885   5239853056
2018-11-01     6005191  555.00  563.00   585.50   551.25   98107   5581027328
2018-11-02     6005191  585.00  599.90   600.00   572.24   89157   5227695104

[4094 rows x 7 columns]

In [259]:
贵州茅台 = 贵州茅台原始数据.set_index('day')

In [260]:
# loc索引器
# 单个元素
贵州茅台.loc['2001-08-27']

STOCK_CODE    6.005191e+06
open          3.451000e+01
close         3.555000e+01
maximum       3.778000e+01
minimum       3.285000e+01
volume        4.063180e+05
TURNOVER      1.410347e+09
Name: 2001-08-27, dtype: float64

In [261]:
贵州茅台.loc['2001-08-27','close']

35.55

In [262]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [263]:
贵州茅台.loc['2001-10-08',['open','close']]

open     37.00
close    36.58
Name: 2001-10-08, dtype: float64

In [264]:
贵州茅台.loc['2001-08-27':'2001-10-08']

            STOCK_CODE   open  close  maximum  minimum  volume    TURNOVER
day
2001-08-27     6005191  34.51  35.55    37.78    32.85  406318  1410347008
2001-08-28     6005191  34.99  36.86    37.00    34.61  129647   463463008
2001-08-29     6005191  36.98  36.38    37.00    36.10   53252   194689000
2001-08-30     6005191  36.28  37.10    37.51    36.00   48013   177558000
2001-08-31     6005191  37.15  37.01    37.62    36.80   23231    86231000
2001-09-03     6005191  37.20  36.99    37.57    36.85   22112    82129000
2001-09-04     6005191  37.01  37.46    38.08    36.88   37006   139204000
2001-09-05     6005191  37.61  37.44    37.92    37.21   26066    97796000
2001-09-06     6005191  37.35  36.70    37.47    36.51   28997   107078000
2001-09-07     6005191  36.50  35.68    36.95    35.65   31552   113868000
2001-09-10     6005191  35.40  36.70    36.85    35.01   18878    68406000
2001-09-11     6005191  36.80  36.29    36.95    36.20   11390    41579000
2001-09-12     6005191  35.33  35.98    36.20    35.30   25045    89421000
2001-09-13     6005191  36.01  35.89    36.30    35.70   10986    39512000
2001-09-14     6005191  36.01  36.30    36.50    35.80    7672    27740000
2001-09-17     6005191  36.08  35.84    36.29    35.50    8983    32183000
2001-09-18     6005191  35.88  36.25    36.55    35.85   10773    39006000
2001-09-19     6005191  36.30  36.92    36.92    36.06    8650    31597000
2001-09-20     6005191  36.90  36.61    37.05    36.50   11173    41189000
2001-09-21     6005191  36.28  36.06    36.60    36.00    7879    28638000
2001-09-24     6005191  36.06  36.05    36.39    36.00    4068    14703000
2001-09-25     6005191  36.28  36.23    36.54    36.05    3488    12639000
2001-09-26     6005191  36.11  36.08    36.48    36.00    4956    17892000
2001-09-27     6005191  36.08  36.70    36.98    36.00    8778    32085000
2001-09-28     6005191  36.90  37.09    37.20    36.50   17088    63169000
2001-10-08     6005191  37.00  36.58    37.18    36.25    6552    24091000

In [265]:
贵州茅台.loc['2001-08-27':'2001-10-08','open']

day
2001-08-27    34.51
2001-08-28    34.99
2001-08-29    36.98
2001-08-30    36.28
2001-08-31    37.15
2001-09-03    37.20
2001-09-04    37.01
2001-09-05    37.61
2001-09-06    37.35
2001-09-07    36.50
2001-09-10    35.40
2001-09-11    36.80
2001-09-12    35.33
2001-09-13    36.01
2001-09-14    36.01
2001-09-17    36.08
2001-09-18    35.88
2001-09-19    36.30
2001-09-20    36.90
2001-09-21    36.28
2001-09-24    36.06
2001-09-25    36.28
2001-09-26    36.11
2001-09-27    36.08
2001-09-28    36.90
2001-10-08    37.00
Name: open, dtype: float64

In [266]:
条件1= 贵州茅台['open']<35
条件2= 贵州茅台['close']<35
布尔列表= 条件1 & 条件2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [267]:
条件3= 贵州茅台['open']<37
条件4= 贵州茅台['close']<37
多尔列表= 条件3 & 条件4
贵州茅台.loc[多尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume    TURNOVER
day
2001-08-27     6005191  34.51  35.55    37.78    32.85  406318  1410347008
2001-08-28     6005191  34.99  36.86    37.00    34.61  129647   463463008
2001-08-29     6005191  36.98  36.38    37.00    36.10   53252   194689000
2001-09-07     6005191  36.50  35.68    36.95    35.65   31552   113868000
2001-09-10     6005191  35.40  36.70    36.85    35.01   18878    68406000
...                ...    ...    ...      ...      ...     ...         ...
2004-12-28     6005191  35.50  36.67    36.93    35.50    2924    10655265
2004-12-30     6005191  36.90  36.81    37.25    36.33    3345    12358921
2004-12-31     6005191  36.70  36.64    37.70    36.08    5870    21514898
2005-01-04     6005191  36.40  36.45    36.80    36.00    2349     8566179
2005-01-07     6005191  36.50  36.90    37.20    36.50    3003    11115440

[669 rows x 7 columns]

In [268]:
#使用函数作为索引
def condition(pd):
    条件1= 贵州茅台['open']<35
    条件2= 贵州茅台['close']<35
    布尔列表= 条件1 & 条件2
    return 布尔列表

In [269]:
def condition(pd):
    条件1= 贵州茅台['open']<35
    条件2= 贵州茅台['close']<35
    return 条件1 & 条件2

In [270]:
贵州茅台.loc[condition]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [276]:
贵州茅台.query('open <35 and close <35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [278]:
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2008-03-03     6005191  204.10  214.50   214.50   204.10   17783   380241616
2001-10-12     6005191   35.90   36.00    36.65    34.05   20010    70897000
2006-08-24     6005191   44.00   44.11    44.40    43.88   12574    55366636
2016-01-05     6005191  210.00  212.82   213.97   207.51   31909   672596336
2006-02-22     6005191   58.35   58.70    59.00    58.00   10335    60384853
2017-02-27     6005191  362.49  357.20   362.85   356.80   25400   912927184
2018-02-13     6005191  705.02  711.98   714.82   704.50   53389  3793782384
2007-01-04     6005191   90.01   85.84    90.18    85.50   44665   394957200
2011-11-02     6005191  204.95  209.57   209.65   204.60   26647   550968560
2003-04-08     6005191   25.69   25.60    25.70    25.35    6113    15568085

In [279]:
#获取关于特定对象、变量或数据类型的信息
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [280]:
# 描述统计 describe
贵州茅台.describe()

,STOCK_CODE,open,close,maximum,minimum,volume,TURNOVER
count,4094.0,4094.000000,4094.000000,4094.000000,4094.000000,4094.000000,4.094000e+03
mean,6005191.0,182.161910,182.435230,184.879680,179.801353,27092.525892,6.487986e+08
std,0.0,165.857882,165.994905,168.082099,163.752065,24623.472099,9.550262e+08
min,6005191.0,20.900000,20.880000,21.000000,20.710000,238.000000,1.421413e+06
25%,6005191.0,47.405000,47.482500,48.222500,46.705000,10186.750000,6.203505e+07
50%,6005191.0,159.930000,159.980000,161.910000,157.875000,22491.000000,3.727192e+08
75%,6005191.0,208.500000,209.457500,212.175000,205.945000,36759.500000,7.486596e+08
max,6005191.0,800.000000,799.190000,803.500000,788.880000,406318.000000,1.066339e+10

In [281]:
贵州茅台['open'].describe()

count    4094.000000
mean      182.161910
std       165.857882
min        20.900000
25%        47.405000
50%       159.930000
75%       208.500000
max       800.000000
Name: open, dtype: float64

In [282]:
#唯一值（不同值）
result=贵州茅台['open'].unique()

In [283]:
result2=贵州茅台['open'].nunique()

In [284]:
result3=贵州茅台['open'].value_counts()

In [287]:
df = pd.DataFrame({
    "name":["A","B","C","B","C","A","C"],
    "value":[1,3,7,2,4,3,1]
})
df.groupby("name")["value"].sum()

name
A     4
B     5
C    12
Name: value, dtype: int64